layoel/DSE/Codigo PSoC 5Lp/FINAL.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC_DelSig</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC_DelSig_DSM_DEC_PM_ACT_CFG</name>
          <description>Decimator Active mode Power Register</description>
          <addressOffset>0x400043AA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_dsm_channel</name>
              <description>Enable delta-sigma modulator ADC channel. Note: set the appropriate enables in the analog interface prior to setting this global enable for the channel.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable_DSM_Channel</name>
                  <description>Disable power to DSM channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable_DSM_Channel</name>
                  <description>Enable power to DSM channel.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_dec</name>
              <description>Enable decimator(s). Populated subsystems are counted from the LSB.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_DEC</name>
                  <description>Disable power to Decimator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DEC</name>
                  <description>Enable power to Decimator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DSM_DEC_PM_STBY_CFG</name>
          <description>Decimator Alternate Active mode Power Register</description>
          <addressOffset>0x400043BA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_dsm_channel</name>
              <description>Enable delta-sigma modulator ADC channel. Note: set the appropriate enables in the analog interface prior to setting this global enable for the channel.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable_DSM_Channel</name>
                  <description>Disable power to DSM channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable_DSM_Channel</name>
                  <description>Enable power to DSM channel during Standby power mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_dec</name>
              <description>Enable decimator(s). Populated subsystems are counted from the LSB.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_DEC</name>
                  <description>Disable power to Decimator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DEC</name>
                  <description>Enable power to Decimator during Standby power mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_CR</name>
          <description>Decimator Control Register</description>
          <addressOffset>0x40004E00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>sta_en</name>
              <description>Controls saturation logic in the Post Processing filter. When enabled, the resulting outputs of the Post Processing filter are held to the most positive or negative values, rather then wrapping around. Conversion results are unpredictable if this bit is changed while the Post Processing filter is running. This bit is ignored if FIR_EN, OCOR_EN and GCOR_EN are all 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAT_DIS</name>
                  <description>No saturation control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAT_EN</name>
                  <description>Saturation Control Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>fir_en</name>
              <description>Controls whether or not Post Processing filter implements a FIR filter. If this bit is set it enables the Post Processing filter. Conversion results are unpredictable if this bit is changed while the filter is running. The decimation period of this filter is controlled by the DR2 bits in register DR2 and DR2H.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIR_DIS</name>
                  <description>FIR filter function Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIR_EN</name>
                  <description>FIR filter function is on.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ocor_en</name>
              <description>This bit controls the offset correction feature of the Post Processing filter. If this bit is set it enables the Post Processing filter. The offset value is programmed in the OCOR bits of registers OCOR, OCORM and OCORH. Conversion results are unpredictable if this bit is changed while the filter is running.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCOR_DIS</name>
                  <description>No offset correction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCOR_EN</name>
                  <description>Offset correction enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>gcor_en</name>
              <description>This bit controls the gain correction feature of the Post Processing filter. If this bit is set it enables the Post Processing filter. The gain coefficient is programmed in the GCOR bits of registers GCOR and GCORH. Which bits in this 16-bit field that are valid is set in GVAL. Conversion results are unpredictable if this bit is changed while the filter is running. When this feature is enabled, the DR1 register field must be set to a value higher than 32 (worst case) for proper operation.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GCOR_DIS</name>
                  <description>Default: no gain correction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCOR_EN</name>
                  <description>Gain correction enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>conv_mode</name>
              <description>The value in these two bits controls the sampling mode the Decimator runs in. </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_SAMPLE</name>
                  <description>Single Sample Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_FILTER</name>
                  <description>Fast Filter Mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous Mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_FIR</name>
                  <description>Fast FIR.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>xstart_en</name>
              <description>Controls whether DSI signal ext_start is active. If XSTART_EN is high, it allows the ext_start input to start a conversion just as START_CONV does. Regardless of the state of this bit, writing to START_CONV will start a conversion.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XSTART_DIS</name>
                  <description>Default: DSI signal ext_start is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XSTART_EN</name>
                  <description>Enable the DSI input signal ext_start to start a conversion.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>start_conv</name>
              <description>A write of 1 to this bit starts a conversion (regardless of the state of XSTART_EN) according to the CONV_MODE set in bits 2, 3. If read, a 1 indicates the filter is running when not in Single Sample mode. If a 0 is read the block is in the standby state when not in Single Sample mode. When in Single Sample more this bit is cleared shortly after it is written and does not reflect the running state of the Decimator. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEC_STOP</name>
                  <description>Kill current conversion (if running) and enter Standby state (SW reset).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC_START</name>
                  <description>Initiate a conversion.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_SR</name>
          <description>Decimator Status Register</description>
          <addressOffset>0x40004E01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>coreclk_disable</name>
              <description>This bit when set high disables (gates off) the clock to the entire core of the block (adc_clk). This includes all FFs except those used for the AHB interface and CSRs. When disabled (set high) the AHB interface to the CSR is still fully functional. This bit is ANDed with the primary input signal cic_clk_en to control the clock gate. cic_clk_en must be high and CoreCLK_Disable must be low for the clock to run.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORECLK_DISABLE_LOW</name>
                  <description>Core Clock is Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORECLK_DISABLE_HIGH</name>
                  <description>Core Clock is Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>intr_pulse</name>
              <description>This read/write bit selects if cic_intr is pulse or level sensed. If level, a sample completion sets cic_intr high where it remains until bit 2 is written, a soft-reset if performed or if OUTSAMP/M/H is read. If pulse, a single cycle (pclk) strobe is generated on cic_intr to be used as an edge sensed interrupt or a DMAREQ. Regardless of which is selected, the interrupt output is still subject to masking by bit 1.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTR_LEVEL</name>
                  <description>Selects a level interrupt on cic_intr.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTR_PULSE</name>
                  <description>Selects a pulse interrupt on cic_intr.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>out_align</name>
              <description>This bit when set high causes a read of OUTSAMP to produce the contents of OUTSAMPM and OUTSAMPM to produce the contents of OUTSAMPH. Effectively, this is an 8-bit right shift of the result. Note that the setting of this bit does not alter the content of the OUTSAMP registers. Setting this bit simply realigns the byte lanes when the register is read. If this bit is set low, the OUTSAMP registers are read normally. </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT_ALIGN_LOW</name>
                  <description>No affect on SAMP Registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT_ALIGN_HIGH</name>
                  <description>Shifts SAMP registers right by 8-bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>intr_clr</name>
              <description>INTR_CLR is a write-only bit that clears bit0 and cic_intr. A read always produces a 0.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTR_NOP</name>
                  <description>No affect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTR_CLEAR</name>
                  <description>Clears CONV_DONE and the interrupt on cic_intr (if enabled).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>intr_mask</name>
              <description>INTR_MASK is a RD/WR bit that controls the generation of the conversion completion interrupt. A read produces that last value written to this bit. This bit functions as a mask regardless of the value of bit 4 (INTR PULSE).</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTR_ENABLED</name>
                  <description>Allows CONV_DONE to generate an interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTR_MASKED</name>
                  <description>Masks the interrupt generation on cic_intr.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>conv_done</name>
              <description>CONV_DONE is a read-only bit indicating that the most recently started conversion has completed if it has been cleared since the last sample read. This same bit is the interrupt signal cic_intr when bit 4 is low, if not masked by bit 1. This bit is intended to provide a polling mechanism should this be preferred to receiving interrupts. It is cleared by writing a 1 to bit 2, a soft-reset or a read of register OUTSAMP, OUTSAMPM or OUTSAMPH (regardless of Coherency settings).</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONV_NOTCOMP</name>
                  <description>Most recently started conversion completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONV_COMP</name>
                  <description>Conversion not completed since last clear.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_SHIFT1</name>
          <description>Decimator Shift Register</description>
          <addressOffset>0x40004E02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>shift1</name>
              <description>Value for left shift amount of modulator input data. 0 = no shift, 1 = left shift by 1 bit, .... up to the max supported 31.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_SHIFT2</name>
          <description>Decimator Shift Register</description>
          <addressOffset>0x40004E03</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>shift2</name>
              <description>Value for the amount of right shift for the output of the CIC filter prior to entering the Post Processor. Functional values range from 0 to 15, 0 = no shift.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_DR2</name>
          <description>Decimator Decimation Rate (2) Register</description>
          <addressOffset>0x40004E04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>dr2_low</name>
              <description>FIR Filter decimation ratio bits [7:0] (of [9:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_DR2H</name>
          <description>Decimator Decimation Rate and Overflow Correction Register</description>
          <addressOffset>0x40004E05</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>of_width</name>
              <description>Occupying the top 5 bits of this register is the Overflow Correction Bit-Width field (it is unrelated to the DR2). This field both enables and sets the bit width of the Overflow Correction logic in the CIC core.</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>dr2_high</name>
              <description>FIR Filter decimation ratio bits [9:8] (of [9:0]). See description in DR2 register.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_DR1</name>
          <description>Decimator Decimation Rate (1) Register</description>
          <addressOffset>0x40004E06</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>dr1</name>
              <description>CIC Filter decimation rate.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DEC_OCOR</name>
          <description>Decimator Offset Correction Coefficient (Low Byte) Register</description>
          <addressOffset>0x40004E08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ocor_low</name>
              <description>Offset correction coefficient bits [7:0] (of [23:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
