layoel/DSE/Codigo PSoC 5Lp/FINAL.svd
        <register>
          <name>ADC_DelSig_DSM_CR15</name>
          <description>Delta Sigma Modulator Control Register 15</description>
          <addressOffset>0x4000588F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>power_comp</name>
              <description>The power control for the quantizer block.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER_COMP_VERYLOW</name>
                  <description>very low (2.2uA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_COMP_NORMAL</name>
                  <description>Normal (8.6uA)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_COMP_6MHZ</name>
                  <description>6MHz (17uA)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_COMP_12MHZ</name>
                  <description>12MHz (35uA)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>power2_3</name>
              <description>The power control for the second and third integrator stages.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER2_3_LOW</name>
                  <description>LOW (4uA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER2_3_MEDIUM</name>
                  <description>MEDIUM (17uA)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER2_3_HIGH</name>
                  <description>HIGH (68uA)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER2_3_1P5X</name>
                  <description>1.5X (100uA)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER2_3_2X</name>
                  <description>2X (135uA)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER2_3_HIGH_5</name>
                  <description>HIGH (68uA)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER2_3_HIGH_6</name>
                  <description>HIGH (68uA)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER2_3_HIGH_7</name>
                  <description>HIGH (68uA)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DSM_CR16</name>
          <description>Delta Sigma Modulator Control Register 16</description>
          <addressOffset>0x40005890</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>power_sum</name>
              <description>The power control for the summer block.</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER_SUM_LOW</name>
                  <description>LOW (4uA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_SUM_MEDIUM</name>
                  <description>MEDIUM (17uA)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_SUM_HIGH</name>
                  <description>HIGH (68uA)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_SUM_1P5X</name>
                  <description>1.5X (100uA)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_SUM_2X</name>
                  <description>2X (135uA)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_SUM_HIGH_5</name>
                  <description>HIGH (68uA)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_SUM_HIGH_6</name>
                  <description>HIGH (68uA)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_SUM_HIGH_7</name>
                  <description>HIGH (68uA)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_cp</name>
              <description>     Enable charge pump.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP_DISABLE</name>
                  <description>Disable charge pump</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_ENABLE</name>
                  <description>Enable charge pump</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>cp_pwrctl</name>
              <description>Charge Pump Power Control Modes.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP_PWRCTL_TURBO</name>
                  <description>Charge pump operating in Turbo Power (560uA) mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_PWRCTL_2X</name>
                  <description>Charge pump operating in 6MHz (300uA) mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_PWRCTL_HIGH</name>
                  <description>Charge pump operating in High power (170uA) mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_PWRCTL_MEDIUM</name>
                  <description>Charge pump operating in Medium power (70uA) mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_PWRCTL_LOW</name>
                  <description>Charge pump operating in Low Power (30uA) mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_PWRCTL_5</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_PWRCTL_6</name>
                  <description>Reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_PWRCTL_7</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DSM_CR17</name>
          <description>Delta Sigma Modulator Control Register 17</description>
          <addressOffset>0x40005891</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>pwr_ctrl_vref_inn</name>
              <description>Power control modes for REFBUF1 (the reference buffer that connects ADC reference to the negative input MUX of the channel).</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_INN_LOW</name>
                  <description>VREF Buffer (Input mux path) is operating in Low Power (26uA) mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_INN_MEDIUM</name>
                  <description>VREF Buffer (Input mux path) is operating in Medium Power (32uA) mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_INN_HIGH</name>
                  <description>VREF Buffer (Input mux path) is operating in High Power (118uA) mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_INN_TURBO</name>
                  <description>VREF Buffer (Input mux path) is operating in Turbo Power (232uA) mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>pwr_ctrl_vcm</name>
              <description>Power Control for the Voltage Common Mode Buffer for the Sigma Delta ADC.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_CTRL_VCM_0</name>
                  <description>VCM Buffer is operating in Low Power (18 uA) mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VCM_1</name>
                  <description>VCM Buffer is operating in Medium Power (28 uA) mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VCM_2</name>
                  <description>VCM Buffer is operating in High Power (55 uA) mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VCM_3</name>
                  <description>VCM Buffer is operating in Turbo Power (114 uA) mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>pwr_ctrl_vref</name>
              <description>Power Control for the Voltage Reference Buffer for the Sigma Delta ADC.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_0</name>
                  <description>VREF Buffer is operating in Low Power (26 uA) mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_1</name>
                  <description>VREF Buffer is operating in Medium Power (32 uA) mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_2</name>
                  <description>VREF Buffer is operating in High Power (118 uA) mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_CTRL_VREF_3</name>
                  <description>VREF Buffer is operating in Turbo Power (232 uA) mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_buf_vcm</name>
              <description>Enable/Disable control for ADC (Internal)Reference Buffer.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_BUF_VCM_0</name>
                  <description>The ADC Output common mode (VCM) voltage buffer is powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_BUF_VCM_1</name>
                  <description>The ADC Output common mode (VCM) voltage buffer is NOT powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_buf_vref</name>
              <description>Enable/Disable control for ADC (Internal)Reference Buffer.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_BUF_VREF_0</name>
                  <description>The Internal Reference Voltage Buffer is powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_BUF_VREF_1</name>
                  <description>The Internal Reference Voltage Buffer is NOT powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DSM_REF0</name>
          <description>Delta Sigma Modulator Reference Register 0</description>
          <addressOffset>0x40005892</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>vcmsel</name>
              <description>Output common mode selection for modulator</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VCMSEL_0</name>
                  <description>No selection is made for VCM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCMSEL_1</name>
                  <description>0.8V from bandgap trim buffer is being selected as VCM (output common mode) for the DSM opamps</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCMSEL_2</name>
                  <description>0.7V from bandgap trim buffer is being selected as VCM (output common mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCMSEL_3</name>
                  <description>Vssd being selected as VCM (output common mode) for the DSM opamps</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vcm_res_div_en</name>
              <description>If enabled it allows the resistor divided value of (Vpwra/2) to a selectable voltage for the VCM Mux</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VCM_RES_DIV_DISABLE</name>
                  <description>VCM resistor divider disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCM_RES_DIV_ENABLE</name>
                  <description>VCM resistor divider enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>vref_res_div_en</name>
              <description>If enabled it allows the resistor divided value of (Vda/4) to a selectable voltage for the RefMux</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_RES_DIV_DISABLE</name>
                  <description>VREF resistor divider disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF_RES_DIV_ENABLE</name>
                  <description>VREF resistor divider enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_buf_vref_inn</name>
              <description>Enable/Disable control for ADC (internal) REFBUF1 Buffer; This buffers the ADC reference before being sent to INN Mux.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>refmux</name>
              <description>Mux control that allows for selecting one among the various available internal reference values</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFMUX_0</name>
                  <description>No Selection made for VCM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFMUX_1</name>
                  <description>VDAC0 output is the reference for the DSM</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFMUX_2</name>
                  <description>Vda/4 is selected as the reference for the DSM (Vda is the external voltage supply)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFMUX_3</name>
                  <description>Vda/3 is selected as the reference for the DSM (Vda is the external voltage supply)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFMUX_4</name>
                  <description>internal precision bandgap reference of 1.024 (typ) is selected as the DSM reference</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFMUX_5</name>
                  <description>internal precision bandgap reference of 1.2V (typ) is selected as the DSM reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFMUX_6</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFMUX_7</name>
                  <description>N/A</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DelSig_DSM_REF1</name>
          <description>Delta Sigma Modulator Reference Register 1</description>
          <addressOffset>0x40005893</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>dac_gnd_sel</name>
              <description>Selects DSM Reference DAC Capacitor Ground.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSM_DAC_GND_SEL_INT</name>
                  <description>select DSM internal vssa</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DAC_GND_SEL_EXT</name>
                  <description>select external ground (AGL6)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
